problems/+kamojjala/@Uniaxial2d/meshes/unitCube8x8_grading/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 0.5 0) 
    (0 0.5 0) //3
    (0 0 1)
    (1 0 1)
    (1 0.5 1)
    (0 0.5 1) //7

    (0 1 0) //8
    (1 1 0)
    (1 1 1)
    (0 1 1) //11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (8 8 1) simpleGrading (0.05 10 1)
    hex (3 2 9 8 7 6 10 11) (8 8 1) simpleGrading (0.05 0.10 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (8 11 10 9)
        );
    }

    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (3 7 11 8)
        );
    }
    
    right
    {
        type wall;
        faces
        (
            (1 2 6 5)
            (2 9 10 6)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    back 
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (3 8 9 2)
        );
    }

    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (7 6 10 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
